[
  {
    "period": "2024-04 – current time",
    "results": [
      "Made a logo for a student organization.",
      "Implement a website for a student organization.",
      "Write SMM texts for a student organization.",
      "Automated the calculation of piecework wages for a student organization in Google Sheets."
    ],
    "role": "Frontend engineer first and foremost, in addition to designer and other roles",
    "shortDescription": "Independent development",
    "skills": [
      "Angular",
      "GoggleSheets",
      "HTML5",
      "RxJS",
      "SASS",
      "SMM",
      "SVG",
      "TS"
    ]
  },
  {
    "period": "2018-04 – 2018-04",
    "results": [
      "Created a delivery calculator for a logistics organization."
    ],
    "role": "Web developer",
    "shortDescription": "Independent development",
    "skills": [
      "CSS",
      "HTML5",
      "JS"
    ]
  },
  {
    "period": "2019-08 – 2019-11",
    "results": [
      "Developed two SPA as part of a team commissioned by the Moscow government.",
      "Organized innovations to improve the quality of frontend development."
    ],
    "role": "Frontend developer",
    "shortDescription": "Contractor-producer of government websites",
    "skills": [
      "Bitbucket",
      "Confluence",
      "HTML5",
      "Jira",
      "JS",
      "SASS",
      "Vue"
    ]
  },
  {
    "period": "2016-07 – 2019-07",
    "results": [
      "SaaS, SPA interface development, OOP component architecture design, component and library implementation, API provision for third-party departments.",
      "Optimization, Virtual DOM, Pixel Perfect, cross-browser compatibility (including IE11).",
      "Managed a team and reviewed colleagues' code."
    ],
    "role": "Software engineer",
    "shortDescription": "SaaS, accounting and business management software provider",
    "skills": [
      "CrossBrowserCompatibility",
      "CSS",
      "Git",
      "GitLab",
      "HTML5",
      "JS",
      "ManagementOfEmployees",
      "OOP",
      "PixelPerfect",
      "SPA",
      "WaSaby",
      "XML"
    ]
  },
  {
    "period": "2015-10 – 2016-05",
    "results": [
      "Created a parser for news from competitors' websites.",
      "Made a promo page.",
      "Made a quiz for a pastry shop's promotional page.",
      "Design, development, and technical support of websites and web services based on PHP, JavaScript, MySQL, HTML, CSS, and SVG technologies."
    ],
    "role": "Fullstack developer",
    "shortDescription": "An information portal of the Trans-Baikal Territory",
    "skills": [
      "CSS",
      "HTML5",
      "JS",
      "MySQL",
      "PHP",
      "SVG"
    ]
  },
  {
    "period": "2016-04 – 2016-08",
    "results": [
      "Built websites for eight clients as a team.",
      "Сreated on my own a web application for a tablet to draw up an estimate specification and administer a set of services.",
      "Website development and management, primarily for online stores. Resource analytics and optimization. Contextual advertising.",
      "Layout development, JavaScript, asynchronous database queries, PHP, MySQL."
    ],
    "role": "Junior fullstack developer",
    "shortDescription": "A web studio",
    "skills": [
      "CSS",
      "HTML5",
      "JS",
      "MySQL",
      "PHP"
    ]
  },
  {
    "period": "2016-01 – 2017-04",
    "results": [
      "Made a logo for student intellectual quizzes.",
      "Implemented a website in a team to promote a student competition.",
      "Automated the calculation of piecework wages for combine harvester operators in an agricultural company via a web application."
    ],
    "role": "Junior fullstack developer",
    "shortDescription": "Independent development",
    "skills": [
      "CorelDRAW",
      "CSS",
      "HTML5",
      "JS",
      "MySQL",
      "PHP"
    ]
  }
]